{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 416, 416, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus", "op": "Softplus", "input": ["batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh", "op": "Tanh", "input": ["Softplus"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh", "inbound_nodes": [[["tf_op_layer_Softplus", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul", "op": "Mul", "input": ["batch_normalization/FusedBatchNormV3", "Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul", "inbound_nodes": [[["batch_normalization", 0, 0, {}], ["tf_op_layer_Tanh", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": true, "dtype": "float32", "padding": [[1, 0], [1, 0]], "data_format": "channels_last"}, "name": "zero_padding2d", "inbound_nodes": [[["tf_op_layer_Mul", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_1", "op": "Softplus", "input": ["batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_1", "op": "Tanh", "input": ["Softplus_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_1", "inbound_nodes": [[["tf_op_layer_Softplus_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_1", "op": "Mul", "input": ["batch_normalization_1/FusedBatchNormV3", "Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["tf_op_layer_Tanh_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["tf_op_layer_Mul_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_3", "op": "Softplus", "input": ["batch_normalization_3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_3", "op": "Tanh", "input": ["Softplus_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_3", "inbound_nodes": [[["tf_op_layer_Softplus_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_3", "op": "Mul", "input": ["batch_normalization_3/FusedBatchNormV3", "Tanh_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}], ["tf_op_layer_Tanh_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["tf_op_layer_Mul_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_4", "op": "Softplus", "input": ["batch_normalization_4/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_4", "op": "Tanh", "input": ["Softplus_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_4", "inbound_nodes": [[["tf_op_layer_Softplus_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_4", "op": "Mul", "input": ["batch_normalization_4/FusedBatchNormV3", "Tanh_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["tf_op_layer_Tanh_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["tf_op_layer_Mul_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_5", "op": "Softplus", "input": ["batch_normalization_5/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_5", "op": "Tanh", "input": ["Softplus_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_5", "inbound_nodes": [[["tf_op_layer_Softplus_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_5", "op": "Mul", "input": ["batch_normalization_5/FusedBatchNormV3", "Tanh_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["tf_op_layer_Tanh_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2", "op": "AddV2", "input": ["Mul_3", "Mul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2", "inbound_nodes": [[["tf_op_layer_Mul_3", 0, 0, {}], ["tf_op_layer_Mul_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["tf_op_layer_AddV2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["tf_op_layer_Mul_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_6", "op": "Softplus", "input": ["batch_normalization_6/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_2", "op": "Softplus", "input": ["batch_normalization_2/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_6", "op": "Tanh", "input": ["Softplus_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_6", "inbound_nodes": [[["tf_op_layer_Softplus_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_2", "op": "Tanh", "input": ["Softplus_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_2", "inbound_nodes": [[["tf_op_layer_Softplus_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_6", "op": "Mul", "input": ["batch_normalization_6/FusedBatchNormV3", "Tanh_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["tf_op_layer_Tanh_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_2", "op": "Mul", "input": ["batch_normalization_2/FusedBatchNormV3", "Tanh_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["tf_op_layer_Tanh_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat", "trainable": true, "dtype": "float32", "node_def": {"name": "concat", "op": "ConcatV2", "input": ["Mul_6", "Mul_2", "concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": -1}}, "name": "tf_op_layer_concat", "inbound_nodes": [[["tf_op_layer_Mul_6", 0, 0, {}], ["tf_op_layer_Mul_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["tf_op_layer_concat", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_7", "op": "Softplus", "input": ["batch_normalization_7/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_7", "op": "Tanh", "input": ["Softplus_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_7", "inbound_nodes": [[["tf_op_layer_Softplus_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_7", "op": "Mul", "input": ["batch_normalization_7/FusedBatchNormV3", "Tanh_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}], ["tf_op_layer_Tanh_7", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[1, 0], [1, 0]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["tf_op_layer_Mul_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_8", "op": "Softplus", "input": ["batch_normalization_8/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_8", "op": "Tanh", "input": ["Softplus_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_8", "inbound_nodes": [[["tf_op_layer_Softplus_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_8", "op": "Mul", "input": ["batch_normalization_8/FusedBatchNormV3", "Tanh_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["tf_op_layer_Tanh_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["tf_op_layer_Mul_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_10", "op": "Softplus", "input": ["batch_normalization_10/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_10", "op": "Tanh", "input": ["Softplus_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_10", "inbound_nodes": [[["tf_op_layer_Softplus_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_10", "op": "Mul", "input": ["batch_normalization_10/FusedBatchNormV3", "Tanh_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["tf_op_layer_Tanh_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_11", "inbound_nodes": [[["tf_op_layer_Mul_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_11", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_11", "op": "Softplus", "input": ["batch_normalization_11/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_11", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_11", "op": "Tanh", "input": ["Softplus_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_11", "inbound_nodes": [[["tf_op_layer_Softplus_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_11", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_11", "op": "Mul", "input": ["batch_normalization_11/FusedBatchNormV3", "Tanh_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["tf_op_layer_Tanh_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_12", "inbound_nodes": [[["tf_op_layer_Mul_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_12", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_12", "op": "Softplus", "input": ["batch_normalization_12/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_12", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_12", "op": "Tanh", "input": ["Softplus_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_12", "inbound_nodes": [[["tf_op_layer_Softplus_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_12", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_12", "op": "Mul", "input": ["batch_normalization_12/FusedBatchNormV3", "Tanh_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["tf_op_layer_Tanh_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_1", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_1", "op": "AddV2", "input": ["Mul_10", "Mul_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_1", "inbound_nodes": [[["tf_op_layer_Mul_10", 0, 0, {}], ["tf_op_layer_Mul_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_13", "inbound_nodes": [[["tf_op_layer_AddV2_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_13", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_13", "op": "Softplus", "input": ["batch_normalization_13/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_13", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_13", "op": "Tanh", "input": ["Softplus_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_13", "inbound_nodes": [[["tf_op_layer_Softplus_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_13", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_13", "op": "Mul", "input": ["batch_normalization_13/FusedBatchNormV3", "Tanh_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["tf_op_layer_Tanh_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_14", "inbound_nodes": [[["tf_op_layer_Mul_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_14", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_14", "op": "Softplus", "input": ["batch_normalization_14/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_14", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_14", "op": "Tanh", "input": ["Softplus_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_14", "inbound_nodes": [[["tf_op_layer_Softplus_14", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_14", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_14", "op": "Mul", "input": ["batch_normalization_14/FusedBatchNormV3", "Tanh_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}], ["tf_op_layer_Tanh_14", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_2", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_2", "op": "AddV2", "input": ["AddV2_1", "Mul_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_2", "inbound_nodes": [[["tf_op_layer_AddV2_1", 0, 0, {}], ["tf_op_layer_Mul_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_15", "inbound_nodes": [[["tf_op_layer_AddV2_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["tf_op_layer_Mul_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_15", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_15", "op": "Softplus", "input": ["batch_normalization_15/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_9", "op": "Softplus", "input": ["batch_normalization_9/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_15", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_15", "op": "Tanh", "input": ["Softplus_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_15", "inbound_nodes": [[["tf_op_layer_Softplus_15", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_9", "op": "Tanh", "input": ["Softplus_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_9", "inbound_nodes": [[["tf_op_layer_Softplus_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_15", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_15", "op": "Mul", "input": ["batch_normalization_15/FusedBatchNormV3", "Tanh_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}], ["tf_op_layer_Tanh_15", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_9", "op": "Mul", "input": ["batch_normalization_9/FusedBatchNormV3", "Tanh_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["tf_op_layer_Tanh_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_1", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_1", "op": "ConcatV2", "input": ["Mul_15", "Mul_9", "concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": -1}}, "name": "tf_op_layer_concat_1", "inbound_nodes": [[["tf_op_layer_Mul_15", 0, 0, {}], ["tf_op_layer_Mul_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_16", "inbound_nodes": [[["tf_op_layer_concat_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_16", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_16", "op": "Softplus", "input": ["batch_normalization_16/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_16", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_16", "op": "Tanh", "input": ["Softplus_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_16", "inbound_nodes": [[["tf_op_layer_Softplus_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_16", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_16", "op": "Mul", "input": ["batch_normalization_16/FusedBatchNormV3", "Tanh_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}], ["tf_op_layer_Tanh_16", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "dtype": "float32", "padding": [[1, 0], [1, 0]], "data_format": "channels_last"}, "name": "zero_padding2d_2", "inbound_nodes": [[["tf_op_layer_Mul_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_17", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_17", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_17", "op": "Softplus", "input": ["batch_normalization_17/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_17", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_17", "op": "Tanh", "input": ["Softplus_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_17", "inbound_nodes": [[["tf_op_layer_Softplus_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_17", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_17", "op": "Mul", "input": ["batch_normalization_17/FusedBatchNormV3", "Tanh_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}], ["tf_op_layer_Tanh_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0.0}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_19", "inbound_nodes": [[["tf_op_layer_Mul_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softplus_19", "trainable": true, "dtype": "float32", "node_def": {"name": "Softplus_19", "op": "Softplus", "input": ["batch_normalization_19/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softplus_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Tanh_19", "trainable": true, "dtype": "float32", "node_def": {"name": "Tanh_19", "op": "Tanh", "input": ["Softplus_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Tanh_19", "inbound_nodes": [[["tf_op_layer_Softplus_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_19", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_19", "op": "Mul", "input": ["batch_normalization_19/FusedBatchNormV3", "Tanh_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["tf_op_layer_Tanh_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", 